app/Controllers/Authorization.php

SELECT *
FROM `users`
WHERE `email` = 'tester@tester.com'
 LIMIT 1
---
    public function Signin()
    {
        if (session()->get('LOGGED_IN'))
            return redirect()->to('/');

        $callback = $this->request->getVar('callback');
        $res = ['submit' => false, 'success' => false, 'message' => '', 'callback' => ''];
        $form = $this->request->getPost();
        if (!empty($form))
        {
            $res['submit'] = true;
            $callback = $form['callback'] ?? '';
            $username = $form['username'];
            $password = $form['password'];
            $err = [];
            if (empty($username))
                $err[] = 'กรุณากรอกอีเมลของท่าน';
            if (empty($password))
                $err[] = 'กรุณากรอกรหัสผ่าน';
            if (count($err) > 0)
                $res['message'] = join('<br>', $err);
            else
            {
                $user = (new UsersModel())->where('email', $username)->first();