app/Controllers/BaseController.php

    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Do Not Edit This Line
        parent::initController($request, $response, $logger);

        // Preload any models, libraries, etc, here.

        // E.g.: $this->session = \Config\Services::session();
        if (session()->get('LOGGED_IN'))
        {
            $userLogged = (new UsersModel)->where('user_id', base64_decode(session()->get('UID')))->first();
            if (empty($userLogged))
                return redirect()->to('/signout');
            unset($userLogged['login_pwd']);
            $userLogged['pending_pay_alert'] = (new EnrollModel)->where([
                    'user_id' => $userLogged['user_id'],
                    'enroll.status' => 'PENDING_PAY'
                ])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `enroll`
WHERE `user_id` = '1'
AND `enroll`.`status` = 'PENDING_PAY'